xml/hash.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> <soap:Body>
    <SHA2B64 xmlns="https://turkpos.com.tr/">
        <Data>-Islem_Guvenlik_Str-</Data>
    </SHA2B64>
</soap:Body>
</soap:Envelope>